Revit 2027 API
RebarConstraintsManager.GetPreferredConstraintOnHandle Method
For ShapeDriven: Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.
For FreeForm: Returns the RebarConstraint that acts on the specified RebarConstraintHandle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarConstraint GetPreferredConstraintOnHandle(
	RebarConstrainedHandle handle
)
Public Function GetPreferredConstraintOnHandle (
	handle As RebarConstrainedHandle
) As RebarConstraint
public:
RebarConstraint^ GetPreferredConstraintOnHandle(
	RebarConstrainedHandle^ handle
)
member GetPreferredConstraintOnHandle :
        handle : RebarConstrainedHandle -> RebarConstraint
Parameters
handle RebarConstrainedHandle
 The RebarConstrainedHandle for which the RebarConstraint is to be returned.
Return Value
RebarConstraint
 The user preferred RebarConstraint applied to the RebarConstrainedHandle.
Exceptions
Exception | Condition
ArgumentException |  handle is no longer valid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The RebarConstraintsManager does not manage a valid Rebar element.
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace